pjanczyk/stm32-flac-player/Src/main.c
#define AUDIO_OUT_BUFFER_SIZE                      8192
enum {
  BUFFER_OFFSET_NONE = 0,  
  BUFFER_OFFSET_HALF,  
  BUFFER_OFFSET_FULL,     
};

uint8_t buff[AUDIO_OUT_BUFFER_SIZE];
static FIL file;
extern ApplicationTypeDef Appli_state;
static uint8_t player_state = 0;
static uint8_t buf_offs = BUFFER_OFFSET_NONE;
static uint32_t fpos = 0;


void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
    buf_offs = BUFFER_OFFSET_FULL;
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{ 
    buf_offs = BUFFER_OFFSET_HALF;
}




/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for FATFS */
  MX_FATFS_Init();

  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();

  /* USER CODE BEGIN 5 */

    vTaskDelay(1000);

    do {
        xprintf("waiting for USB mass storage\r\n");
        vTaskDelay(250);
    } while (Appli_state != APPLICATION_READY);

    FRESULT res = f_open(&file, "1:/test_1k.wav", FA_READ);

    if (res == FR_OK) {
        xprintf("wave file open OK\r\n");
    } else {
        xprintf("wave file open ERROR, res = %d\r\n", res);
        while (1) {}
    }

    //workaround: use 22K to play 44K
    if (BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE1, 60, AUDIO_FREQUENCY_22K) == 0) {
        xprintf("audio init OK\r\n");
    } else {
        xprintf("audio init ERROR\r\n");
    }


    /* Infinite loop */
    for (;;) {

        BSP_TS_GetState(&TS_State);
        if (TS_State.touchDetected) {
            BSP_LCD_Clear(LCD_COLOR_WHITE);
            BSP_LCD_SetTextColor(0x40FF00FF);
            BSP_LCD_FillCircle(TS_State.touchX[0], TS_State.touchY[0], 40);
        }

        char key = inkey();

        switch (key) {
            case 'p': {
                xprintf("play command...\r\n");
                if (player_state) {
                    xprintf("already playing\r\n");
                    break;
                }
                player_state = 1;
                BSP_AUDIO_OUT_Play((uint16_t *) &buff[0], AUDIO_OUT_BUFFER_SIZE);
                fpos = 0;
                buf_offs = BUFFER_OFFSET_NONE;
                break;
            }
        }

        if (player_state) {
            uint32_t br;

            if (buf_offs == BUFFER_OFFSET_HALF) {
                if (f_read(&file,
                           &buff[0],
                           AUDIO_OUT_BUFFER_SIZE / 2,
                           (void *) &br) != FR_OK) {
                    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
                    xprintf("f_read error on half\r\n");
                }
                buf_offs = BUFFER_OFFSET_NONE;
                fpos += br;

            }

            if (buf_offs == BUFFER_OFFSET_FULL) {
                if (f_read(&file,
                           &buff[AUDIO_OUT_BUFFER_SIZE / 2],
                           AUDIO_OUT_BUFFER_SIZE / 2,
                           (void *) &br) != FR_OK) {
                    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
                    xprintf("f_read error on full\r\n");
                }

                buf_offs = BUFFER_OFFSET_NONE;
                fpos += br;
            }

            if (br < AUDIO_OUT_BUFFER_SIZE / 2) {
                xprintf("stop at eof\r\n");
                BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
                player_state = 0;
            }
        }  //if(player_state)


        vTaskDelay(2);

  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
